import '../models/common/tokyo_shikuchouson_data.dart';

List<TokyoShikuchousonData> getTokyoShikuchouson() {
  const String shikuchouson = '''
131016|千代田区|ちよだく|102-8688|千代田区九段南1-2-1|03-3264-2111
131024|中央区|ちゅうおうく|104-8404|中央区築地1-1-1|03-3543-0211
131032|港区|みなとく|105-8511|港区芝公園1-5-25|03-3578-2111
131041|新宿区|しんじゅくく|160-8484|新宿区歌舞伎町1-4-1|03-3209-1111
131059|文京区|ぶんきょうく|112-8555|文京区春日1-16-21|03-3812-7111
131067|台東区|たいとうく|110-8615|台東区東上野4-5-6|03-5246-1111
131075|墨田区|すみだく|130-8640|墨田区吾妻橋1-23-20|03-5608-1111
131083|江東区|こうとうく|135-8383|江東区東陽4-11-28|03-3647-9111
131091|品川区|しながわく|140-8715|品川区広町2-1-36|03-3777-1111
131105|目黒区|めぐろく|153-8573|目黒区上目黒2-19-15|03-3715-1111
131113|大田区|おおたく|144-8621|大田区蒲田5-13-14|03-5744-1111
131121|世田谷区|せたがやく|154-8504|世田谷区世田谷4-21-27|03-5432-1111
131130|渋谷区|しぶやく|150-8010|渋谷区宇田川町1-1|03-3463-1211
131148|中野区|なかのく|164-8501|中野区中野4-11-19|03-3389-1111
131156|杉並区|すぎなみく|166-8570|杉並区阿佐谷南1-15-1|03-3312-2111
131164|豊島区|としまく|171-8422|豊島区南池袋2-45-1|03-3981-1111
131172|北区|きたく|114-8508|北区王子本町1-15-22|03-3908-1111
131181|荒川区|あらかわく|116-8501|荒川区荒川2-2-3|03-3802-3111
131199|板橋区|いたばしく|173-8501|板橋区板橋2-66-1|03-3964-1111
131202|練馬区|ねりまく|176-8501|練馬区豊玉北6-12-1|03-3993-1111
131211|足立区|あだちく|120-8510|足立区中央本町1-17-1|03-3880-5111
131229|葛飾区|かつしかく|124-8555|葛飾区立石5-13-1|03-3695-1111
131237|江戸川区|えどがわく|132-8501|江戸川区中央1-4-1|03-3652-1151
132012|八王子市|はちおうじし|192-8501|八王子市元本郷町3-24-1|042-626-3111
132021|立川市|たちかわし|190-8666|立川市泉町1156-9|042-523-2111
132039|武蔵野市|むさしのし|180-8777|武蔵野市緑町2-2-28|0422-51-5131
132047|三鷹市|みたかし|181-8555|三鷹市野崎1-1-1|0422-45-1151
132055|青梅市|おうめし|198-8701|青梅市東青梅1-11-1|0428-22-1111
132063|府中市|ふちゅうし|183-8703|府中市宮西町2-24|042-364-4111
132071|昭島市|あきしまし|196-8511|昭島市田中町1-17-1|042-544-5111
132080|調布市|ちょうふし|182-8511|調布市小島町2-35-1|042-481-7111
132098|町田市|まちだし|194-8520|町田市森野2-2-22|042-722-3111
132101|小金井市|こがねいし|184-8504|小金井市本町6-6-3|042-383-1111
132110|小平市|こだいらし|187-8701|小平市小川町2-1333|042-341-1211
132128|日野市|ひのし|191-0016|日野市神明1-12-1|042-585-1111
132136|東村山市|ひがしむらやまし|189-8501|東村山市本町1-2-3|042-393-5111
132144|国分寺市|こくぶんじし|185-8501|国分寺市戸倉1-6-1|042-325-0111
132152|国立市|くにたちし|186-8501|国立市富士見台2-47-1|042-576-2111
132187|福生市|ふっさし|197-8501|福生市本町5|042-551-1511
132195|狛江市|こまえし|201-8585|狛江市和泉本町1-1-5|03-3430-1111
132209|東大和市|ひがしやまとし|207-8585|東大和市中央3-930|042-563-2111
132217|清瀬市|きよせし|204-8511|清瀬市中里5-842|042-492-5111
132225|東久留米市|ひがしくるめし|203-8555|東久留米市本町3-3-1|042-470-7777
132233|武蔵村山市|むさしむらやまし|208-8501|武蔵村山市本町1-1-1|042-565-1111
132241|多摩市|たまし|206-8666|多摩市関戸6-12-1|042-375-8111
132250|稲城市|いなぎし|206-8601|稲城市東長沼2111|042-378-2111
132276|羽村市|はむらし|205-8601|羽村市緑ヶ丘5-2-1|042-555-1111
132284|あきる野市|あきるのし|197-0814|あきる野市二宮350|042-558-1111
132292|西東京市|にしとうきょうし|188-8666|西東京市南町5-6-13|042-464-1311
133035|瑞穂町|みずほまち|190-1292|西多摩郡瑞穂町大字箱根ヶ崎2335|042-557-0501
133051|日の出町|ひのでまち|190-0192|西多摩郡日の出町平井2780|042-597-0511
133078|檜原村|ひのはらむら|190-0212|西多摩郡檜原村467-1|042-598-1011
133086|奥多摩町|おくたままち|198-0212|西多摩郡奥多摩町氷川215-6|0428-83-2111
133612|大島町|おおしままち|100-0101|大島町元町1-1-14|04992-2-1443
133621|利島村|としまむら|100-0301|利島村248|04992-9-0011
133639|新島村|にいじまむら|100-0402|新島村本村1-1-1|04992-5-0240
133647|神津島村|こうづしまむら|100-0601|神津島村904|04992-8-0011
133817|三宅村|みやけむら|100-1212|三宅島三宅村阿古497|04994-5-0981
133825|御蔵島村|みくらじまむら|100-1301|御蔵島村字入かねが沢|04994-8-2121
134015|八丈町|はちじょうまち|100-1498|八丈島八丈町大賀郷2551-2|04996-2-1121
134023|青ヶ島村|あおがしまむら|100-1701|青ヶ島村無番地|04996-9-0111
134210|小笠原村|おがさわらむら|100-2101|小笠原村父島字西町|04998-2-3111
      ''';

  final List<String> exShikuchouson = shikuchouson.split('\n');

  final List<TokyoShikuchousonData> list = <TokyoShikuchousonData>[];

  for (int i = 0; i < exShikuchouson.length; i++) {
    if (exShikuchouson[i].trim() == '') {
      continue;
    }

    final List<String> exData = exShikuchouson[i].split('|');

    final TokyoShikuchousonData val = TokyoShikuchousonData(
        code: exData[0], name: exData[1], furigana: exData[2], postal: exData[3], address: exData[4], tel: exData[5]);

    list.add(val);
  }

  return list;
}
